# language: ru
@payment
Функция: Оплата товара в интернет-магазине банковской картой

  @success
  Сценарий: Успешная оплата товара
    Дано на балансе банковской карты покупателя имеется 5000 рублей
    Когда покупатель оплачивает товар стоимостью 2000 рублей
    Тогда списание проходит успешно
    И баланс банковской карты становится 3000 рублей

  @fail
  Сценарий: Отказ в оплате из-за нехватки средств
    Дано на балансе банковской карты покупателя имеется 1000 рублей
    Когда покупатель оплачивает товар стоимостью 2000 рублей
    Тогда появляется предупреждение "Недостаточно средств на карте"
